vln14/exampleTA/STM32L476RG-Nucleo/Inc/lc_sensor_metering.h
/**
******************************************************************************
* @file    lc_sensor_metering.h
* @author  MCD Application Team
* @version V1.0.0
* @date    8-September-2017
* @brief   LC sensor system information.
******************************************************************************
* @attention
*
* <h2><center>&copy; Copyright (c) 2017 STMicroelectronics International N.V.
* All rights reserved.</center></h2>
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted, provided that the following conditions are met:
*
* 1. Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
* 2. Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
* 3. Neither the name of STMicroelectronics nor the names of other
*    contributors to this software may be used to endorse or promote products
*    derived from this software without specific written permission.
* 4. This software, including modifications and/or derivative works of this
*    software, must execute solely and exclusively on microcontroller or
*    microprocessor devices manufactured by or for STMicroelectronics.
* 5. Redistribution and use of this software other than as permitted under
*    this license is void and will automatically terminate your rights under
*    this license.
*
* THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
* LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
* PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
* RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
* SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************
*/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __LC_SENSOR_METERING_H
#define __LC_SENSOR_METERING_H


#ifdef __cplusplus
extern "C"
{
#endif

  /* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"
#include "math.h"

  /* external defines -----------------------------------------------------------*/
  /** @defgroup LC_Appli_Config To configure application
  * @{
  */
  /** @brief Select demonstration mode:
  * 1 = Basic counting demo with 1 sensor
  * 2 = Counting demo with 2 sensors rotation and direction detection
  * 3 = Tachometer demo with 2 sensors rotation and direction detection
  * 4 = Counting demo with 2 x 2 sensors 
  */
#define LC_SENSOR_DEMO 1

  /** @brief Select board configuration (Hardware dependant):
  * 1 =  board configuration 1 with Vmid on PA4 pin
  * 2 = board configuration 2 with Vmid on PA5 pin
  */
#define BOARD_CONFIG 2

  /** @brief Enable USART2 communication to send status infos to user or others peripherals
  * 0 = USART2 disabled
  * 1 = USART2 enabled 
  */
#define USART2_ENABLE 1

  /** @brief Select excitation mode:
  * 0 = LC excitation to Vss
  * 1 = LC excitation to Vdda
  */
#define LC_EXCIT_MODE 1
  /**
  * @}
  */

  /** @defgroup LC_Debug Debug purpose
  * @{
  */
  /* #define COMP1_OUT_ENABLED */        /*!< Uncomment to enable comparator 1 output for pulses count observation (debug only) - PB0 pin */
  /* #define COMP2_OUT_ENABLED */        /*!< Uncomment to enable comparator 2 output for pulses count observation (debug only) - PB11 pin */
  /**
  * @}
  */

  /** @defgroup LC_Hardware Hardware configuration
  * @{
  */
#if (LC_SENSOR_DEMO == 1)               /* Demo1 configuration - Basic counting demo with 1 sensor */
#define SENSOR_1_ENABLED              /*!< 1st LC sensor enabled */
#endif /* LC_SENSOR_DEMO 1 */

#if (LC_SENSOR_DEMO == 2)               /* Demo2 configuration - Counting demo with 2 sensors rotation/direction detection*/
#define SENSOR_1_ENABLED              /*!< 1st LC sensor enabled */
#define SENSOR_2_ENABLED              /*!< 2nd LC sensors enabled */
#endif /* LC_SENSOR_DEMO 2 */

#if (LC_SENSOR_DEMO == 3)               /* Demo3 configuration - Tachometer demo with 2 sensors rotation/direction detection */
#define SENSOR_1_ENABLED              /*!< 1st LC sensor enabled */
#define SENSOR_2_ENABLED              /*!< 2nd LC sensors enabled */
#endif /* LC_SENSOR_DEMO 3 */

#if (LC_SENSOR_DEMO == 4)               /* Demo4 configuration - Counting demo with 2 x 2 sensors*/
#define SENSOR_1_ENABLED              /*!< 1st LC sensor enabled */
#define SENSOR_2_ENABLED              /*!< 2nd LC sensors enabled */
#define SENSOR_3_ENABLED              /*!< 3rd LC sensors enabled */
#define SENSOR_4_ENABLED              /*!< 4th LC sensors enabled */
#endif /* LC_SENSOR_DEMO 4 */
  /**
  * @}
  */

  /* Board Configuration 1
  IOs configuration for the STM32L4xx devices
  +-------------------------------+
  | LC IOs  | PINs  | LC Function |
  |---------|-------|-------------|
  | LC_IO1  | PA4   | Vmid        |
  | LC_IO2  | PC5   | Sensor1     |
  | LC_IO3  | PB2   | Sensor2     |
  | LC_IO4  | PB4   | Sensor3     |
  | LC_IO5  | PB6   | Sensor4     |
  +-------------------------------+

  DAC Outputs for the STM32L4xx devices
  +---------------------------------------+
  |                 | DAC1                |
  |-----------------|---------------------|
  | DAC1 OUT1       | PA4 (LC_IO1)        |
  |-----------------|---------------------|
  | DAC1 OUT2       | COMP1 Input (minus) |
  |                 | COMP2 Input (minus) |
  +---------------------------------------+

