vln14/exampleTA/STM32L476RG-Nucleo/Inc/lc_sensor_metering.h
  /**
  * @brief  Sensors variables structure
  */
  typedef struct
  {
    uint32_t CountTmp1;                  /*!< tmp variable used to store counter status */
    uint32_t CountTmp2;                  /*!< tmp variable used to store counter status */
    uint32_t CountDetect;                /*!< Count number for detection */
    uint32_t CountValue;                 /*!< Variable used to store current oscillations number */
    uint32_t CountMax;                   /*!< Variable used to store maximum count number (air)*/
    uint32_t CountMin;                   /*!< Variable used to store maximum count number (metal)*/
    uint32_t Transitions;                /*!< Variable used to count transitions number */
    LcSensor_StatusTypeEnum PreviousStatus;/*!< Status METAL or NO_METAL */
    LcSensor_StatusTypeEnum Status;      /*!< Previous status METAL or NO_METAL */
  }
  LcSensor_Sensor_f;

  /**
  * @brief  LC dynamic variables structure used to drive LC sensor
  */
  typedef struct
  {
    uint32_t IO1_GPIO_GROUP;            /*!< To store IO1 GPIOx_MODER address */
    uint32_t IO1_ANALOG;                /*!< To store GPIOx_MODER for IO1 analog state */
    uint32_t IO1_OUTPUT_PP;             /*!< To store GPIOx_MODER for IO1 output PP */
    uint32_t IO2_GPIO_GROUP;            /*!< To store IO2 GPIOx_MODER address */
    uint32_t IO2_ANALOG;                /*!< To store GPIOx_MODER for IO2 analog state */
    uint32_t IO2_OUTPUT_PP;             /*!< To store GPIOx_MODER for IO2 output PP */
    uint32_t IO3_GPIO_GROUP;            /*!< To store IO3 GPIOx_MODER address */
    uint32_t IO3_ANALOG;                /*!< To store GPIOx_MODER for IO3 analog state */
    uint32_t IO3_OUTPUT_PP;             /*!< To store GPIOx_MODER for IO3 output PP */
    uint32_t IO4_GPIO_GROUP;            /*!< To store IO4 GPIOx_MODER address */
    uint32_t IO4_ANALOG;                /*!< To store GPIOx_MODER for IO4 analog state */
    uint32_t IO4_OUTPUT_PP;             /*!< To store GPIOx_MODER for IO4 output PP */
    uint32_t IO5_GPIO_GROUP;            /*!< To store IO5 GPIOx_MODER address */
    uint32_t IO5_ANALOG;                /*!< To store GPIOx_MODER for IO5 analog state */
    uint32_t IO5_OUTPUT_PP;             /*!< To store GPIOx_MODER for IO5 output PP */
  }
  LcSensor_IO_f;

  /* Exported constants --------------------------------------------------------*/
  /* Exported macro ------------------------------------------------------------*/
  /* External variables --------------------------------------------------------*/
  /** @addtogroup LC_Exported_Variables
  * @{
  */
  extern LcSensor_Init_f LcConfig;              /*!< Lc application configuration */
  extern LcSensor_LcStatus_f LcStatus;          /*!< Lc application status */
  extern LcSensor_SensorInit_f LcConfigSensor1; /*!< Sensor1 configuration */
  extern LcSensor_SensorInit_f LcConfigSensor2; /*!< Sensor2 configuration */
  extern LcSensor_SensorInit_f LcConfigSensor3; /*!< Sensor3 configuration */
  extern LcSensor_SensorInit_f LcConfigSensor4; /*!< Sensor4 configuration */
  extern LcSensor_Sensor_f LcSensor1;           /*!< Sensor1 status */
  extern LcSensor_Sensor_f LcSensor2;           /*!< Sensor2 status */
  extern LcSensor_Sensor_f LcSensor3;           /*!< Sensor3 status */
  extern LcSensor_Sensor_f LcSensor4;           /*!< Sensor4 status */
  extern LcSensor_IO_f LcIO;                    /*!< Variables to drive sensors */
  /**
  * @}
  */
  /* Exported functions --------------------------------------------------------*/
  /** @addtogroup LC_Exported_Functions
  * @{
  */
  void LcSensorConfig(void);                    /*!< Configure application */
  void LcSensorDemo(void);                      /*!< Start LC sensor demonstration */
  void LcSensorInit(void);                      /*!< Initialize all variables used for Lc Sesnor demo */
  /**
  * @}
  */

  /* Private typedef -----------------------------------------------------------*/
  /* Private macros ------------------------------------------------------------*/
  /**
  * @brief  Compute Tx Buffer size.
  * @retval Size of Transmission buffer
  */
#define TXBUFFERSIZE(__BUFFER__) (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)) - 1) /*!< Size of Transmission buffer */
  /* Private variables ---------------------------------------------------------*/
  /* Private functions ---------------------------------------------------------*/

#ifdef __cplusplus
}
#endif

#endif /* __LC_SENSOR_METERING_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

